y = [0, 0, 0, 0, 0, 0, 0];
y(5) = 0; %y(0)
y(6) = 1; %y(-1)
y(7) = 2; %y(-2)
Xn = 1;
y(1) = 2 * y(5) - y(6) + Xn; % y(1) = 2 * y(1 - 1) - y(1 - 2) + Xn
y(2) = 2 * y(1) - y(5) + Xn; % y(2) = 2 * y(2 - 1) - y(2 - 2) + Xn
y(3) = 2 * y(2) - y(1) + Xn; % y(3) = 2 * y(3 - 1) - y(3 - 2) + Xn
y(4) = 2 * y(3) - y(2) + Xn; % y(4) = 2 * y(4 - 1) - y(4 - 2) + Xn
disp(y(1:4))

%% Optimize
clc, clearvars, clear all

Y = zeros(1,7);
Xn = 1;
Y(1)=2; Y(2)=1;
for n = 3:7
    Y(n)= 2*Y(n-1)-Y(n-2)+Xn; %𝑦[𝑛] = 2𝑦[𝑛 − 1] − 𝑦[𝑛 − 2] + 𝑥[𝑛], 𝑛 ≥ 0
end 
Y=Y(4:7);

